PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
  stm3240g_writereg(LCD_REG_7, 0); 

  /* Remember the power off state */

  g_lcddev.power = 0;
  return OK;
}

/**************************************************************************************
 * Name:  stm3240g_setpower
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWER: full on). On
 *   backlit LCDs, this setting may correspond to the backlight setting.
 *
 **************************************************************************************/

static int stm3240g_setpower(struct lcd_dev_s *dev, int power)
{
  lcdvdbg("power: %d\n", power);
  DEBUGASSERT((unsigned)power <= CONFIG_LCD_MAXPOWER);

  /* Set new power level */

  if (power > 0)
    {
      /* Then turn the display on */

#if !defined(CONFIG_STM32_ILI9320_DISABLE) || !defined(CONFIG_STM32_ILI9325_DISABLE)
      stm3240g_writereg(LCD_REG_7, 0x0173);
#endif
      g_lcddev.power = power;
    }
  else
    {
      /* Turn the display off */

      stm3240g_poweroff();
    }

  return OK;
}

/**************************************************************************************
 * Name:  stm3240g_getcontrast
 *
 * Description:
 *   Get the current contrast setting (0-CONFIG_LCD_MAXCONTRAST).
 *
 **************************************************************************************/

static int stm3240g_getcontrast(struct lcd_dev_s *dev)
{
  lcdvdbg("Not implemented\n");
  return -ENOSYS;
}

/**************************************************************************************
 * Name:  stm3240g_setcontrast
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 **************************************************************************************/

static int stm3240g_setcontrast(struct lcd_dev_s *dev, unsigned int contrast)
{
  lcdvdbg("contrast: %d\n", contrast);
  return -ENOSYS;
}

/**************************************************************************************
 * Name:  stm3240g_lcdinitialize
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 **************************************************************************************/

static inline void stm3240g_lcdinitialize(void)
{
  uint16_t id;

  /* Check LCD ID */

  id = stm3240g_readreg(LCD_REG_0);
  lcddbg("LCD ID: %04x\n", id);

  /* Check if the ID is for the STM32_ILI9320 (or ILI9321) or STM32_ILI9325 */

#if !defined(CONFIG_STM32_ILI9320_DISABLE) && !defined(CONFIG_STM32_ILI9325_DISABLE)
  if (id == ILI9320_ID || id == ILI9321_ID || id == ILI9325_ID)
#elif !defined(CONFIG_STM32_ILI9320_DISABLE) && defined(CONFIG_STM32_ILI9325_DISABLE)
  if (id == ILI9320_ID || id == ILI9321_ID)
#else /* if defined(CONFIG_STM32_ILI9320_DISABLE) && !defined(CONFIG_STM32_ILI9325_DISABLE)) */
  if (id == ILI9325_ID)
#endif
    {
      /* Save the LCD type (not actually used at for anything important) */

#if !defined(CONFIG_STM32_ILI9320_DISABLE)
# if !defined(CONFIG_STM32_ILI9325_DISABLE)
      if (id == ILI9325_ID)
        {
          g_lcddev.type = LCD_TYPE_ILI9325;
        }
      else
# endif
        {
          g_lcddev.type = LCD_TYPE_ILI9320;
          stm3240g_writereg(LCD_REG_229, 0x8000); /* Set the internal vcore voltage */
        }
#else /* if !defined(CONFIG_STM32_ILI9325_DISABLE) */
      g_lcddev.type = LCD_TYPE_ILI9325;
#endif
      lcddbg("LCD type: %d\n", g_lcddev.type);

      /* Start Initial Sequence */

      stm3240g_writereg(LCD_REG_0,   0x0001); /* Start internal OSC. */
      stm3240g_writereg(LCD_REG_1,   0x0100); /* Set SS and SM bit */
      stm3240g_writereg(LCD_REG_2,   0x0700); /* Set 1 line inversion */
      stm3240g_writereg(LCD_REG_3,   0x1030); /* Set GRAM write direction and BGR=1. */
    //stm3240g_writereg(LCD_REG_3,   0x1018); /* Set GRAM write direction and BGR=1. */
      stm3240g_writereg(LCD_REG_4,   0x0000); /* Resize register */
      stm3240g_writereg(LCD_REG_8,   0x0202); /* Set the back porch and front porch */
      stm3240g_writereg(LCD_REG_9,   0x0000); /* Set non-display area refresh cycle ISC[3:0] */
      stm3240g_writereg(LCD_REG_10,  0x0000); /* FMARK function */
      stm3240g_writereg(LCD_REG_12,  0x0000); /* RGB interface setting */
      stm3240g_writereg(LCD_REG_13,  0x0000); /* Frame marker Position */
      stm3240g_writereg(LCD_REG_15,  0x0000); /* RGB interface polarity */

      /* Power On sequence */

      stm3240g_writereg(LCD_REG_16,  0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
      stm3240g_writereg(LCD_REG_18,  0x0000); /* VREG1OUT voltage */
      stm3240g_writereg(LCD_REG_19,  0x0000); /* VDV[4:0] for VCOM amplitude */
      up_mdelay(200);                         /* Dis-charge capacitor power voltage (200ms) */

      stm3240g_writereg(LCD_REG_16,  0x17b0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_18,  0x0139); /* VREG1OUT voltage */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_19,  0x1d00); /* VDV[4:0] for VCOM amplitude */
      stm3240g_writereg(LCD_REG_41,  0x0013); /* VCM[4:0] for VCOMH */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_32,  0x0000); /* GRAM horizontal Address */
      stm3240g_writereg(LCD_REG_33,  0x0000); /* GRAM Vertical Address */

      /* Adjust the Gamma Curve (ILI9320/1) */

#if !defined(CONFIG_STM32_ILI9320_DISABLE)
# if !defined(CONFIG_STM32_ILI9325_DISABLE)
    if (g_lcddev.type == LCD_TYPE_ILI9320)
# endif
      {
        stm3240g_writereg(LCD_REG_48,  0x0006);
        stm3240g_writereg(LCD_REG_49,  0x0101);
        stm3240g_writereg(LCD_REG_50,  0x0003);
        stm3240g_writereg(LCD_REG_53,  0x0106);
        stm3240g_writereg(LCD_REG_54,  0x0b02);
        stm3240g_writereg(LCD_REG_55,  0x0302);
        stm3240g_writereg(LCD_REG_56,  0x0707);
        stm3240g_writereg(LCD_REG_57,  0x0007);
        stm3240g_writereg(LCD_REG_60,  0x0600);
        stm3240g_writereg(LCD_REG_61,  0x020b);
      }
#endif
      /* Adjust the Gamma Curve (ILI9325) */

#if !defined(CONFIG_STM32_ILI9325_DISABLE)
# if !defined(CONFIG_STM32_ILI9320_DISABLE)
    else
# endif
      {
        stm3240g_writereg(LCD_REG_48, 0x0007);
        stm3240g_writereg(LCD_REG_49, 0x0302);
        stm3240g_writereg(LCD_REG_50, 0x0105);
        stm3240g_writereg(LCD_REG_53, 0x0206);
        stm3240g_writereg(LCD_REG_54, 0x0808);
        stm3240g_writereg(LCD_REG_55, 0x0206);
        stm3240g_writereg(LCD_REG_56, 0x0504);
        stm3240g_writereg(LCD_REG_57, 0x0007);
        stm3240g_writereg(LCD_REG_60, 0x0105);
        stm3240g_writereg(LCD_REG_61, 0x0808);
      }
#endif

      /* Set GRAM area */

