PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
      stm3240g_writereg(LCD_REG_80,  0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81,  0x00ef); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82,  0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83,  0x013f); /* Vertical GRAM End Address */
      stm3240g_writereg(LCD_REG_96,  0x2700); /* Gate Scan Line */
    //stm3240g_writereg(LCD_REG_96,  0xa700); /* Gate Scan Line(GS=1, scan direction is G320~G1) */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL,VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* Set scrolling line */

      /* Partial Display Control */

      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x0000);
      stm3240g_writereg(LCD_REG_131, 0x0000);
      stm3240g_writereg(LCD_REG_132, 0x0000);
      stm3240g_writereg(LCD_REG_133, 0x0000);

      /* Panel Control */

      stm3240g_writereg(LCD_REG_144, 0x0010);
      stm3240g_writereg(LCD_REG_146, 0x0000);
      stm3240g_writereg(LCD_REG_147, 0x0003);
      stm3240g_writereg(LCD_REG_149, 0x0110);
      stm3240g_writereg(LCD_REG_151, 0x0000);
      stm3240g_writereg(LCD_REG_152, 0x0000);

      /* Set GRAM write direction and BGR = 1
       *
       * I/D=01 (Horizontal : increment, Vertical : decrement)
       * AM=1 (address is updated in vertical writing direction)
       */

      stm3240g_writereg(LCD_REG_3, 0x1018);
      stm3240g_writereg(LCD_REG_7, 0);       /* Display off */
    }
  else
    {
      lcddbg("Unsupported LCD type\n");
    }
}

 /**************************************************************************************
 * Public Functions
 **************************************************************************************/

/**************************************************************************************
 * Name:  up_lcdinitialize
 *
 * Description:
 *   Initialize the LCD video hardware.  The initial state of the LCD is fully
 *   initialized, display memory cleared, and the LCD ready to use, but with the power
 *   setting at 0 (full off).
 *
 **************************************************************************************/

int up_lcdinitialize(void)
{
  lcdvdbg("Initializing\n");

  /* Configure GPIO pins and configure the FSMC to support the LCD */

  stm32_selectlcd();

  /* Configure and enable LCD */

  up_mdelay(50);
  stm3240g_lcdinitialize();

  /* Clear the display (setting it to the color 0=black) */

  stm3240g_lcdclear(0);

  /* Turn the display off */

  stm3240g_poweroff();
  return OK;
}

/**************************************************************************************
 * Name:  up_lcdgetdev
 *
 * Description:
 *   Return a a reference to the LCD object for the specified LCD.  This allows support
 *   for multiple LCD devices.
 *
 **************************************************************************************/

FAR struct lcd_dev_s *up_lcdgetdev(int lcddev)
{
  DEBUGASSERT(lcddev == 0);
  return &g_lcddev.dev;
}

/**************************************************************************************
 * Name:  up_lcduninitialize
 *
 * Description:
 *   Unitialize the LCD support
 *
 **************************************************************************************/

void up_lcduninitialize(void)
{
  stm3240g_poweroff();
  stm32_deselectlcd();
}

/**************************************************************************************
 * Name:  stm3240g_lcdclear
 *
 * Description:
 *   This is a non-standard LCD interface just for the stm3240g-EVAL board.  Because
 *   of the various rotations, clearing the display in the normal way by writing a
 *   sequences of runs that covers the entire display can be very slow.  Here the
 *   display is cleared by simply setting all GRAM memory to the specified color.
 *
 **************************************************************************************/

void stm3240g_lcdclear(uint16_t color)
{
  uint32_t i = 0;
  
  stm3240g_setcursor(0, STM3240G_XRES-1); 
  stm3240g_gramselect();
  for (i = 0; i < STM3240G_XRES * STM3240G_YRES; i++)
    {
      LCD->value = color;
    }
}

#endif /* !CONFIG_STM32_ILI9320_DISABLE || !CONFIG_STM32_ILI9325_DISABLE */
